nxp-mcuxpresso/mcuxsdk-examples/_boards/mcxw23evk/wireless_examples/reference_design/health_care_iot_peripheral/hardware_init.c
/*
 * Copyright 2025 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/*${header:start}*/
#include "pin_mux.h"
#include "clock_config.h"
#include "board.h"
#include "fsl_power.h"
#include "fwk_platform_ble.h"
/*${header:end}*/

/*${variable:start}*/
/*${variable:end}*/

/*${function:start}*/
void BOARD_InitHardware(void)
{
    POWER_Init();
    
    CLOCK_EnableClock(kCLOCK_Gpio0);
    GPIO_PortInit(GPIO, 0);
    CLOCK_AttachClk(kFRO12M_to_FLEXCOMM1);
    CLOCK_EnableClock(kCLOCK_FlexComm1);
    /* Enable clock that is used by OSTimer and FLASH_CheckECC */
    CLOCK_EnableClock(kCLOCK_Sysctl);
    /* Enable watchdog clock */
    CLOCK_Enable1MFRO(true);
    CLOCK_SetClkDiv(kCLOCK_DivWdtClk, 10U, true);
    
    BOARD_BootClockXTAL32M();
    CLOCK_AttachClk(kOSC32K_to_CTIMER0);
    BOARD_InitPins();
    BOARD_Configure32kOsc();

#if defined(gDebugConsoleEnable_d) && (gDebugConsoleEnable_d == 1)
    BOARD_InitDebugConsole();
#endif
    PLATFORM_InitBle();

    BOARD_InitI2c();
      /* Configure the sensors that share the sensor interrupt line to open drain */
    uint8_t registerValue;
    registerValue = FXLS8974CF_CONFIG4_PP_OD_OPEN_DRAIN << FXLS8974CF_CONFIG4_PP_OD_POS;
    BOARD_I2cWriteFunc(FXLS8974CF_I2C_ADDR, FXLS8974CF_CONFIG4_REG_ADDR, &registerValue, sizeof(registerValue));
    registerValue = FXPQ3115BVT1_CTRL_REG3_PP_OD_OPEN_DRAIN << FXPQ3115BVT1_CTRL_REG3_PP_OD_POS;
    BOARD_I2cWriteFunc(FXPQ3115BVT1_I2C_ADDR, FXPQ3115BVT1_CTRL_REG3_ADDR, &registerValue, sizeof(registerValue));
}
/*${function:end}*/
